<?php

function ArduinoPhonemes($text){ 
    $converter = array(
	    'а' => 'a',    'б' => 'b',    'в' => 'v',    'г' => 'g',    'д' => 'd',
	    'е' => 'e',    'ё' => 'e',    'ж' => 'g',   'з' => 'z',    'джи' => 'g',
		'й' => 'y',    'к' => 'k',    'л' => 'l',    'м' => 'm',    'н' => 'n',
	    'о' => 'o',    'п' => 'p',    'р' => 'r',    'с' => 'c',    'т' => 't',
	    'у' => 'u',    'ф' => 'f',    'х' => 'h',    'ц' => 'c',    'ч' => 'ch',
	    'ш' => 'sh',   'щ' => 'sch',  'ь' => '',     'ы' => 'y',    'ъ' => '',
	    'э' => 'e',    'ю' => 'yu',   'я' => 'ya','аш' => 'h', 'и'=>'','эйч' => 'h',
	    'эйтч' => 'h','эйгхт' => 'h',    'бэ' => 'b',   'дэ' => 'd',   'эй' => 'a',
	    'би' => 'b'
    );
    return (strtr($text, $converter));
}

?>